{
  "users": [
    {
      "id": 2,
      "userName": "Juan Manuel",
      "email": "juan@gmail.com",
      "password": "juantretta",
      "isSubscribed": true
    },
    {
      "id": 3,
      "userName": "diego",
      "email": "diego@gmail.com",
      "password": "diego123",
      "isSubscribed": true
    }
  ],
  "MovieFavs": [
    {
      "idMovie": 575264,
      "poster_path": "/83sGKvCv2T2CulYbd40Aeduc7n2.jpg",
      "overview": "Ethan Hunt (Tom Cruise) y la IMF emprenden la misión más peligrosa a la que nunca se han enfrentado: rastrear una nueva y aterradora arma que amenaza a toda la humanidad antes de que caiga en las manos de un enemigo todopoderoso y misterioso.",
      "keyYoutube": "https://www.youtube.com/embed/HurjfO_TDlQ",
      "idUser": 3,
      "id": 1
    },
    {
      "idMovie": 678512,
      "poster_path": "/apxaWDCqjPrVc1v5HiKW2r10yiL.jpg",
      "overview": "Narra la historia de Tim Ballard, un exagente de Seguridad Nacional de Estados Unidos que dejó su trabajo para dedicar su vida, sumergiéndose en el submundo del tráfico de personas a lo largo de hispanoamérica, a intentar salvar las vidas de cientos de niños.",
      "keyYoutube": "https://www.youtube.com/embed/hyyyKcfJRGQ",
      "idUser": 3,
      "id": 2
    },
    {
      "idMovie": 609681,
      "poster_path": "/vpuuFM032yiX8tox4L84Wl9MGjG.jpg",
      "overview": "Cuando sus obligaciones la envían a un agujero de gusano vinculado a un revolucionario kree, los poderes de Carol Danvers, la capitana Marvel, se entremezclan con los de Kamala Khan, también conocida como la Sra. Marvel y la sobrina de Carol, ahora astronauta de S.A.B.E.R., Monica Rambeau. Juntas, deberán salvar el universo como \"The Marvels\".",
      "keyYoutube": "https://www.youtube.com/embed/uwmDH12MAA4",
      "idUser": 3,
      "id": 3
    },
    {
      "idMovie": 299054,
      "poster_path": "/2jmE7xH0R0dikmc8iplCPCit4MD.jpg",
      "overview": "Cuarta entrega de la saga Los Mercenarios. El veterano mercenario Barney “Esquizo” Ross (Sylvester Stallone) y su equipo de estrellas, formado por los hombres más duros (Jason Statham, Dolph Lundgren, 50 Cent, Megan Fox…), afrontan un nuevo desafío, en una trama cargada de acción. Para superarlo y salir airosos, deberán recurrir a su ingenio, experiencia y a la fuerza bruta que los caracteriza.",
      "keyYoutube": "https://www.youtube.com/embed/Cm3Z1jEjHHc",
      "idUser": 3,
      "id": 4
    },
    {
      "idMovie": 975902,
      "poster_path": "/ssEFC5wfFjj7lJpUgwJDOK1Xu1J.jpg",
      "overview": "La guerrera celta del mismo nombre que gobierna al pueblo iceni junto a su marido Prasutagus. El rey muere a manos de los soldados romanos, dejando el reino de Boudica sin un heredero varón y los romanos se apoderan de sus tierras y propiedades.  Inspirada en los acontecimientos del año 60 d.C., Boudica sigue a la guerrera celta del mismo nombre que gobierna al pueblo iceni junto a su marido Prasutagus. Cuando muere a manos de los soldados romanos, el reino de Boudica se queda sin un heredero varón y los romanos se apoderan de sus tierras y propiedades. Llevada al borde de la locura y decidida a vengar la muerte de su marido, Boudica reúne a las distintas tribus de la región y libra una guerra épica contra el poderoso imperio romano.",
      "keyYoutube": "https://www.youtube.com/embed/nFwuqwVLCl8",
      "idUser": 2,
      "id": 5
    },
    {
      "idMovie": 609681,
      "poster_path": "/vpuuFM032yiX8tox4L84Wl9MGjG.jpg",
      "overview": "Cuando sus obligaciones la envían a un agujero de gusano vinculado a un revolucionario kree, los poderes de Carol Danvers, la capitana Marvel, se entremezclan con los de Kamala Khan, también conocida como la Sra. Marvel y la sobrina de Carol, ahora astronauta de S.A.B.E.R., Monica Rambeau. Juntas, deberán salvar el universo como \"The Marvels\".",
      "keyYoutube": "https://www.youtube.com/embed/uwmDH12MAA4",
      "idUser": 2,
      "id": 6
    },
    {
      "idMovie": 1000081,
      "poster_path": "/wrFg0Q1kqfOhxlRvb8Dle7WF58F.jpg",
      "overview": "François Sentinelle tiene dos vidas. De día, es el policía más famoso de la isla de Reunión, conocido por sus duros métodos y sus camisas floreadas, que persigue a los delincuentes en su Defender amarillo. Pero el resto del tiempo, Sentinelle también es un carismático cantante.",
      "keyYoutube": "https://www.youtube.com/embed/JZvBLLGJ37c",
      "idUser": 2,
      "id": 7
    },
    {
      "idMovie": 926393,
      "poster_path": "/eJKmexmCLwuxOxlAURSMnBVkfmY.jpg",
      "overview": "Desde que renunció a su vida como asesino del gobierno, Robert McCall (Denzel Washington) ha luchado para reconciliarse con las cosas horribles que ha hecho en el pasado y encuentra un extraño consuelo en hacer justicia en nombre de los oprimidos. Mientras se encuentra en su casa en el sur de Italia, descubre que sus nuevos amigos están bajo el control de los jefes del crimen local. A medida que los acontecimientos comienzan a complicarse, McCall entiende lo que tiene que hacer: convertirse en el protector de sus amigos enfrentándose a la temida mafia.",
      "keyYoutube": "https://www.youtube.com/embed/fQfrzHFmVe8",
      "idUser": 2,
      "id": 8
    },
    {
      "idMovie": 939335,
      "poster_path": "/rLu0yO1qCZnWevzofNNFfzJ30tM.jpg",
      "overview": "El policía Jake Rosser presencia el impactante asesinato de su compañero por un misterioso asaltante. Mientras investiga la identidad del tirador, descubre una gran conspiración.",
      "keyYoutube": "https://www.youtube.com/embed/rYY5QdEGEZw",
      "idUser": 2,
      "id": 9
    },
    {
      "idMovie": 872585,
      "poster_path": "/ncKCQVXgk4BcQV6XbvesgZ2zLvZ.jpg",
      "overview": "Película sobre el físico J. Robert Oppenheimer y su papel como desarrollador de la bomba atómica. Basada en el libro 'American Prometheus: The Triumph and Tragedy of J. Robert Oppenheimer' de Kai Bird y Martin J. Sherwin.",
      "keyYoutube": "https://www.youtube.com/embed/uYPbbksJxIg",
      "idUser": 2,
      "id": 10
    },
    {
      "idMovie": 968051,
      "poster_path": "/x0ryPlzZjpOojEAuGrre2lFuBv6.jpg",
      "overview": "En 1956 en Francia, un sacerdote es asesinado y parece que un mal se está extendiendo. La hermana Irene una vez más se encuentra cara a cara con una fuerza demoníaca.",
      "keyYoutube": "https://www.youtube.com/embed/QF-oyCwaArU",
      "idUser": 2,
      "id": 11
    },
    {
      "idMovie": 762430,
      "poster_path": "/mhLYcyxuhb82ttYDEU5DM8b3Hy3.jpg",
      "overview": "Un ejecutivo de un banco recibe, mientras conduce a sus hijos a la escuela, una amenaza de bomba dentro de su auto, el cual explotará si se detienen o salen del vehículo antes de conseguir una elevada suma de dinero. Remake de la película española de 2015 \"El Desconocido\".",
      "keyYoutube": "https://www.youtube.com/embed/Sxyzdo-RBKc",
      "idUser": 2,
      "id": 12
    },
    {
      "idMovie": 951491,
      "poster_path": "/epN0x9JTf3esk1FO8DWkhlE4Ax5.jpg",
      "overview": "Entre los acontecimientos de 'Saw' y 'Saw II', un enfermo y desesperado John Kramer viaja a México para someterse a un procedimiento médico arriesgado y experimental con la esperanza de encontrar una cura milagrosa para su cáncer, sólo para descubrir que toda la operación es una estafa para robar a  los más vulnerables. Armado con un nuevo propósito, el infame asesino en serie regresa a su trabajo, dándole la vuelta a los estafadores en su forma visceral característica a través de trampas tortuosas, trastornadas e ingeniosas.",
      "keyYoutube": "https://www.youtube.com/embed/t3PzUo4P21c",
      "idUser": 2,
      "id": 13
    }
  ]
}