{
  "users": [
    {
      "id": 2,
      "userName": "Juan Manuel",
      "email": "juan@gmail.com",
      "password": "juantretta",
      "isSubscribed": true
    },
    {
      "id": 3,
      "userName": "diego",
      "email": "diego@gmail.com",
      "password": "diego123",
      "isSubscribed": true
    }
  ],
  "MovieFavs": [
    {
      "idMovie": 575264,
      "poster_path": "/83sGKvCv2T2CulYbd40Aeduc7n2.jpg",
      "overview": "Ethan Hunt (Tom Cruise) y la IMF emprenden la misión más peligrosa a la que nunca se han enfrentado: rastrear una nueva y aterradora arma que amenaza a toda la humanidad antes de que caiga en las manos de un enemigo todopoderoso y misterioso.",
      "keyYoutube": "https://www.youtube.com/embed/HurjfO_TDlQ",
      "idUser": 3,
      "id": 1
    },
    {
      "idMovie": 609681,
      "poster_path": "/vpuuFM032yiX8tox4L84Wl9MGjG.jpg",
      "overview": "Cuando sus obligaciones la envían a un agujero de gusano vinculado a un revolucionario kree, los poderes de Carol Danvers, la capitana Marvel, se entremezclan con los de Kamala Khan, también conocida como la Sra. Marvel y la sobrina de Carol, ahora astronauta de S.A.B.E.R., Monica Rambeau. Juntas, deberán salvar el universo como \"The Marvels\".",
      "keyYoutube": "https://www.youtube.com/embed/uwmDH12MAA4",
      "idUser": 3,
      "id": 3
    },
    {
      "idMovie": 299054,
      "poster_path": "/2jmE7xH0R0dikmc8iplCPCit4MD.jpg",
      "overview": "Cuarta entrega de la saga Los Mercenarios. El veterano mercenario Barney “Esquizo” Ross (Sylvester Stallone) y su equipo de estrellas, formado por los hombres más duros (Jason Statham, Dolph Lundgren, 50 Cent, Megan Fox…), afrontan un nuevo desafío, en una trama cargada de acción. Para superarlo y salir airosos, deberán recurrir a su ingenio, experiencia y a la fuerza bruta que los caracteriza.",
      "keyYoutube": "https://www.youtube.com/embed/Cm3Z1jEjHHc",
      "idUser": 3,
      "id": 4
    },
    {
      "idMovie": 968051,
      "poster_path": "/x0ryPlzZjpOojEAuGrre2lFuBv6.jpg",
      "overview": "En 1956 en Francia, un sacerdote es asesinado y parece que un mal se está extendiendo. La hermana Irene una vez más se encuentra cara a cara con una fuerza demoníaca.",
      "keyYoutube": "https://www.youtube.com/embed/QF-oyCwaArU",
      "idUser": 2,
      "id": 11
    },
    {
      "idMovie": 762430,
      "poster_path": "/mhLYcyxuhb82ttYDEU5DM8b3Hy3.jpg",
      "overview": "Un ejecutivo de un banco recibe, mientras conduce a sus hijos a la escuela, una amenaza de bomba dentro de su auto, el cual explotará si se detienen o salen del vehículo antes de conseguir una elevada suma de dinero. Remake de la película española de 2015 \"El Desconocido\".",
      "keyYoutube": "https://www.youtube.com/embed/Sxyzdo-RBKc",
      "idUser": 2,
      "id": 12
    },
    {
      "idMovie": 951491,
      "poster_path": "/epN0x9JTf3esk1FO8DWkhlE4Ax5.jpg",
      "overview": "Entre los acontecimientos de 'Saw' y 'Saw II', un enfermo y desesperado John Kramer viaja a México para someterse a un procedimiento médico arriesgado y experimental con la esperanza de encontrar una cura milagrosa para su cáncer, sólo para descubrir que toda la operación es una estafa para robar a  los más vulnerables. Armado con un nuevo propósito, el infame asesino en serie regresa a su trabajo, dándole la vuelta a los estafadores en su forma visceral característica a través de trampas tortuosas, trastornadas e ingeniosas.",
      "keyYoutube": "https://www.youtube.com/embed/t3PzUo4P21c",
      "idUser": 2,
      "id": 13
    },
    {
      "idMovie": 678512,
      "poster_path": "/apxaWDCqjPrVc1v5HiKW2r10yiL.jpg",
      "overview": "Narra la historia de Tim Ballard, un exagente de Seguridad Nacional de Estados Unidos que dejó su trabajo para dedicar su vida, sumergiéndose en el submundo del tráfico de personas a lo largo de hispanoamérica, a intentar salvar las vidas de cientos de niños.",
      "keyYoutube": "https://www.youtube.com/embed/hyyyKcfJRGQ",
      "idUser": 3,
      "id": 14
    },
    {
      "idMovie": 346698,
      "poster_path": "/fNtqD4BTFj0Bgo9lyoAtmNFzxHN.jpg",
      "overview": "Barbie vive en Barbieland donde todo es ideal y lleno de música y color. Un buen día decide conocer el mundo real. Cuando el CEO de Mattel se entere, tratará de evitarlo a toda costa y devolver a Barbie a una caja.",
      "keyYoutube": "https://www.youtube.com/embed/Y1IgAEejvqM",
      "idUser": null,
      "id": 17
    },
    {
      "idMovie": 9381,
      "poster_path": "/3IBB0Z2dZAWZNkRq6hF9pJsmMtE.jpg",
      "overview": "Tras la caída de las instituciones mundiales más importantes, la humanidad vive en un estado de anarquía total. El aventurero y mercenario Hugo Cornelius Toorop recibe la misión de escoltar a una bella joven desde un remoto convento de Rusia hasta Nueva York. Cuanto más se acerca a su destino, más grande es su sospecha de que lo que debe proteger no es solo una simple muchacha.",
      "keyYoutube": "https://www.youtube.com/embed/_wW9pYbRkjk",
      "idUser": 2,
      "id": 18
    },
    {
      "idMovie": 872585,
      "poster_path": "/ncKCQVXgk4BcQV6XbvesgZ2zLvZ.jpg",
      "overview": "Película sobre el físico J. Robert Oppenheimer y su papel como desarrollador de la bomba atómica. Basada en el libro 'American Prometheus: The Triumph and Tragedy of J. Robert Oppenheimer' de Kai Bird y Martin J. Sherwin.",
      "keyYoutube": "https://www.youtube.com/embed/uYPbbksJxIg",
      "idUser": 2,
      "id": 19
    }
  ]
}